[
  {
    "image": "https://www.crunchgrowth.com/wp-content/uploads/2017/04/mobile_apps.jpg",
    "title": "Photomator",
    "companyName": "PixelSoft",
    "id": 1,
    "description": "Photomator is a powerful yet easy-to-use photo editor for Mac, iPhone, iPad, and Vision Pro. It includes an extensive collection of color adjustments, support for over 750 RAW formats, and a magical Repair tool for removing unwanted objects. It provides all essential tools to enhance and transform your photos with professional-level results, making it suitable for both beginners and expert photographers.",
    "size": 120,
    "reviews": 4523,
    "ratingAvg": 4.5,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2673 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/5SLG2s107uPPgbkjFsKxdEMI8P85FDxZzZ2lXsryBxP3DhcH49ILOtW7verzgV6Xoavz",
    "title": "FitTrack",
    "companyName": "HealthGen",
    "id": 2,
    "description": "FitTrack is an advanced all-in-one fitness app designed to empower users to take control of their health and achieve their fitness goals with ease and precision. Manage workouts, track diet, monitor health metrics, and stay motivated with a comprehensive suite of features. Whether you're a beginner or a fitness enthusiast, FitTrack offers personalized tracking and insights to support a healthier lifestyle every day.",
    "size": 85,
    "reviews": 3201,
    "ratingAvg": 4.2,
    "downloads": "850K",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1100 },
      { "name": "5 star", "count": 1151 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/aOx32taSDWJkVlUScGF4Bto0kVLgv_3Kc0CSE0VISkeP39zfhazsTqtqL_Vt4QbVvw",
    "title": "Mind Notes",
    "companyName": "BrainyApps",
    "id": 3,
    "description": "Mind Notes is a versatile note-taking app that helps organize your daily tasks, class notes, or shopping lists efficiently. Create, annotate, and customize notes with font size, color, and styling options. The app also supports drawing and sketching for visual learners. Sync across devices and categorize your notes to stay productive. Mind Notes is simple, intuitive, and ideal for students, professionals, and anyone needing a reliable digital notebook solution.",
    "size": 45,
    "reviews": 2100,
    "ratingAvg": 4.7,
    "downloads": "560K",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1255 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/qzd5vlydFBIqYusKaQbrHSBsXPM4yi5kHuuspRPu-fTyw7bFwvthksMiSEGY1cUcJuw",
    "title": "TravelBuddy",
    "companyName": "WanderSoft",
    "id": 4,
    "description": "TravelBuddy is a smart trip planner that helps you organize your journeys quickly and efficiently. Plan routes, book hotels, discover attractions, and create day-by-day itineraries. It also provides offline maps and AI-powered suggestions based on interests. Whether you are a casual traveler or an explorer, TravelBuddy simplifies trip planning and ensures you don’t miss important places while keeping everything in one convenient app.",
    "size": 150,
    "reviews": 4120,
    "ratingAvg": 4.3,
    "downloads": "920K",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 1770 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/512/8668/8668837.png",
    "title": "Recipe-Discoveries",
    "companyName": "FoodieLabs",
    "id": 5,
    "description": "Recipe-Discoveries is a free app that suggests recipes based on the ingredients you have at home. You can customize it to avoid allergens and dietary restrictions. Perfect for quick meal planning or experimenting with new dishes, the app offers easy-to-follow instructions and helpful tips. With Recipe-Discoveries, cooking becomes simpler, enjoyable, and tailored to your needs, helping you reduce waste and make the most of available ingredients while trying diverse recipes every day.",
    "size": 75,
    "reviews": 1850,
    "ratingAvg": 4.6,
    "downloads": "450K",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1100 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/8YkXmhweu_LvBzit8FZxSafrXWMg46GqUdopBLkpu-VOD_i1IpN8f5zmlmrGLMI8lhk",
    "title": "WeatherWise",
    "companyName": "SkyNetTech",
    "id": 6,
    "description": "WeatherWise provides accurate weather forecasts with high-resolution radar and alerts. The app ensures you are always informed about severe weather conditions, temperature changes, and precipitation updates. With detailed hourly and weekly forecasts, it is perfect for travelers, outdoor enthusiasts, and anyone planning their day. The intuitive interface, combined with visual maps and real-time updates, keeps you prepared and safe in all weather situations.",
    "size": 60,
    "reviews": 2300,
    "ratingAvg": 4.4,
    "downloads": "700K",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1095 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/sAGShCwPaqv32C3iaenxqM0GkbRpkX-n436HRHlvzHcZYY5H_rWXKilMsdOk85Jb9Hk=w240-h480-rw",
    "title": "EduSphere",
    "companyName": "EduSphere",
    "id": 7,
    "description": "EduSphere is an all-in-one learning app that provides interactive courses, expert-led tutorials, and real-time support. Designed for students and professionals, it helps enhance knowledge and skills for academic and career growth. The app covers a wide variety of subjects and learning paths, with progress tracking, quizzes, and assessments. EduSphere aims to make learning engaging, flexible, and accessible anytime, anywhere, offering an immersive experience for knowledge seekers of all levels.",
    "size": 110,
    "reviews": 3950,
    "ratingAvg": 4.5,
    "downloads": "980K",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 1870 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSojZqN8US1qNy6umDC6M32OEodwHvxgcJbrQ&s",
    "title": "MyBudgetPal",
    "companyName": "FinTech Solutions",
    "id": 8,
    "description": "MyBudgetPal helps users manage expenses, track budgets, and save money with ease. It provides daily, weekly, and monthly spending reports, visual charts, and insights to improve financial discipline. Users can categorize spending for food, transport, bills, and more. With alerts, reminders, and smart suggestions, MyBudgetPal empowers better money management and informed financial decisions. The app is perfect for anyone wanting to stay on top of their finances while simplifying budgeting processes.",
    "size": 95,
    "reviews": 2700,
    "ratingAvg": 4.3,
    "downloads": "650K",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1240 }
    ]
  }
]
